zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/adcife.h
/**
 * \file
 *
 * \brief Component description for ADCIFE
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_ADCIFE_COMPONENT_
#define _SAM4L_ADCIFE_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR ADCIFE */
/* ========================================================================== */
/** \addtogroup SAM4L_ADCIFE ADC controller interface */
/*@{*/

#define ADCIFE_I7569
#define REV_ADCIFE                  0x100

/* -------- ADCIFE_CR : (ADCIFE Offset: 0x00) ( /W 32) Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SWRST:1;          /*!< bit:      0  Software reset                     */
    uint32_t TSTOP:1;          /*!< bit:      1  Internal timer stop bit            */
    uint32_t TSTART:1;         /*!< bit:      2  Internal timer start bit           */
    uint32_t STRIG:1;          /*!< bit:      3  Sequencer trigger                  */
    uint32_t REFBUFEN:1;       /*!< bit:      4  Reference buffer enable            */
    uint32_t REFBUFDIS:1;      /*!< bit:      5  Reference buffer disable           */
    uint32_t :2;               /*!< bit:  6.. 7  Reserved                           */
    uint32_t EN:1;             /*!< bit:      8  ADCIFD enable                      */
    uint32_t DIS:1;            /*!< bit:      9  ADCIFD disable                     */
    uint32_t BGREQEN:1;        /*!< bit:     10  Bandgap buffer request enable      */
    uint32_t BGREQDIS:1;       /*!< bit:     11  Bandgap buffer request disable     */
    uint32_t :20;              /*!< bit: 12..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ADCIFE_CR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADCIFE_CR_OFFSET            0x00         /**< \brief (ADCIFE_CR offset) Control Register */
#define ADCIFE_CR_RESETVALUE        _U_(0x00000000); /**< \brief (ADCIFE_CR reset_value) Control Register */

#define ADCIFE_CR_SWRST_Pos         0            /**< \brief (ADCIFE_CR) Software reset */
#define ADCIFE_CR_SWRST             (_U_(0x1) << ADCIFE_CR_SWRST_Pos)
#define ADCIFE_CR_TSTOP_Pos         1            /**< \brief (ADCIFE_CR) Internal timer stop bit */
#define ADCIFE_CR_TSTOP             (_U_(0x1) << ADCIFE_CR_TSTOP_Pos)
#define ADCIFE_CR_TSTART_Pos        2            /**< \brief (ADCIFE_CR) Internal timer start bit */
#define ADCIFE_CR_TSTART            (_U_(0x1) << ADCIFE_CR_TSTART_Pos)
#define ADCIFE_CR_STRIG_Pos         3            /**< \brief (ADCIFE_CR) Sequencer trigger */
#define ADCIFE_CR_STRIG             (_U_(0x1) << ADCIFE_CR_STRIG_Pos)
#define ADCIFE_CR_REFBUFEN_Pos      4            /**< \brief (ADCIFE_CR) Reference buffer enable */
#define ADCIFE_CR_REFBUFEN          (_U_(0x1) << ADCIFE_CR_REFBUFEN_Pos)
#define ADCIFE_CR_REFBUFDIS_Pos     5            /**< \brief (ADCIFE_CR) Reference buffer disable */
#define ADCIFE_CR_REFBUFDIS         (_U_(0x1) << ADCIFE_CR_REFBUFDIS_Pos)
#define ADCIFE_CR_EN_Pos            8            /**< \brief (ADCIFE_CR) ADCIFD enable */
#define ADCIFE_CR_EN                (_U_(0x1) << ADCIFE_CR_EN_Pos)
#define ADCIFE_CR_DIS_Pos           9            /**< \brief (ADCIFE_CR) ADCIFD disable */
#define ADCIFE_CR_DIS               (_U_(0x1) << ADCIFE_CR_DIS_Pos)
#define ADCIFE_CR_BGREQEN_Pos       10           /**< \brief (ADCIFE_CR) Bandgap buffer request enable */
#define ADCIFE_CR_BGREQEN           (_U_(0x1) << ADCIFE_CR_BGREQEN_Pos)
#define ADCIFE_CR_BGREQDIS_Pos      11           /**< \brief (ADCIFE_CR) Bandgap buffer request disable */
#define ADCIFE_CR_BGREQDIS          (_U_(0x1) << ADCIFE_CR_BGREQDIS_Pos)
#define ADCIFE_CR_MASK              _U_(0x00000F3F) /**< \brief (ADCIFE_CR) MASK Register */

/* -------- ADCIFE_CFG : (ADCIFE Offset: 0x04) (R/W 32) Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :1;               /*!< bit:      0  Reserved                           */
    uint32_t REFSEL:3;         /*!< bit:  1.. 3  ADC Reference Selection            */
    uint32_t SPEED:2;          /*!< bit:  4.. 5  ADC current reduction              */
    uint32_t CLKSEL:1;         /*!< bit:      6  Clock Selection for sequencer/ADC cell */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t PRESCAL:3;        /*!< bit:  8..10  Prescaler Rate Selection           */
    uint32_t :21;              /*!< bit: 11..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ADCIFE_CFG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADCIFE_CFG_OFFSET           0x04         /**< \brief (ADCIFE_CFG offset) Configuration Register */
#define ADCIFE_CFG_RESETVALUE       _U_(0x00000000); /**< \brief (ADCIFE_CFG reset_value) Configuration Register */

#define ADCIFE_CFG_REFSEL_Pos       1            /**< \brief (ADCIFE_CFG) ADC Reference Selection */
#define ADCIFE_CFG_REFSEL_Msk       (_U_(0x7) << ADCIFE_CFG_REFSEL_Pos)
#define ADCIFE_CFG_REFSEL(value)    (ADCIFE_CFG_REFSEL_Msk & ((value) << ADCIFE_CFG_REFSEL_Pos))
#define ADCIFE_CFG_SPEED_Pos        4            /**< \brief (ADCIFE_CFG) ADC current reduction */
#define ADCIFE_CFG_SPEED_Msk        (_U_(0x3) << ADCIFE_CFG_SPEED_Pos)
#define ADCIFE_CFG_SPEED(value)     (ADCIFE_CFG_SPEED_Msk & ((value) << ADCIFE_CFG_SPEED_Pos))
#define ADCIFE_CFG_CLKSEL_Pos       6            /**< \brief (ADCIFE_CFG) Clock Selection for sequencer/ADC cell */
#define ADCIFE_CFG_CLKSEL           (_U_(0x1) << ADCIFE_CFG_CLKSEL_Pos)
#define ADCIFE_CFG_PRESCAL_Pos      8            /**< \brief (ADCIFE_CFG) Prescaler Rate Selection */
#define ADCIFE_CFG_PRESCAL_Msk      (_U_(0x7) << ADCIFE_CFG_PRESCAL_Pos)
#define ADCIFE_CFG_PRESCAL(value)   (ADCIFE_CFG_PRESCAL_Msk & ((value) << ADCIFE_CFG_PRESCAL_Pos))
#define ADCIFE_CFG_MASK             _U_(0x0000077E) /**< \brief (ADCIFE_CFG) MASK Register */

/* -------- ADCIFE_SR : (ADCIFE Offset: 0x08) (R/  32) Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SEOC:1;           /*!< bit:      0  Sequencer end of conversion        */
    uint32_t LOVR:1;           /*!< bit:      1  Sequencer last converted value overrun */
    uint32_t WM:1;             /*!< bit:      2  Window monitor                     */
    uint32_t SMTRG:1;          /*!< bit:      3  Sequencer missed trigger event     */
    uint32_t SUTD:1;           /*!< bit:      4  Start-up time done                 */
    uint32_t TTO:1;            /*!< bit:      5  Timer time-out                     */
    uint32_t :18;              /*!< bit:  6..23  Reserved                           */
    uint32_t EN:1;             /*!< bit:     24  Enable Status                      */
    uint32_t TBUSY:1;          /*!< bit:     25  Timer busy                         */
    uint32_t SBUSY:1;          /*!< bit:     26  Sequencer busy                     */
    uint32_t CBUSY:1;          /*!< bit:     27  Conversion busy                    */
    uint32_t REFBUF:1;         /*!< bit:     28  Reference buffer status            */
    uint32_t :3;               /*!< bit: 29..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ADCIFE_SR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADCIFE_SR_OFFSET            0x08         /**< \brief (ADCIFE_SR offset) Status Register */
#define ADCIFE_SR_RESETVALUE        _U_(0x00000000); /**< \brief (ADCIFE_SR reset_value) Status Register */

#define ADCIFE_SR_SEOC_Pos          0            /**< \brief (ADCIFE_SR) Sequencer end of conversion */
#define ADCIFE_SR_SEOC              (_U_(0x1) << ADCIFE_SR_SEOC_Pos)
#define ADCIFE_SR_LOVR_Pos          1            /**< \brief (ADCIFE_SR) Sequencer last converted value overrun */
#define ADCIFE_SR_LOVR              (_U_(0x1) << ADCIFE_SR_LOVR_Pos)
#define ADCIFE_SR_WM_Pos            2            /**< \brief (ADCIFE_SR) Window monitor */
#define ADCIFE_SR_WM                (_U_(0x1) << ADCIFE_SR_WM_Pos)
#define ADCIFE_SR_SMTRG_Pos         3            /**< \brief (ADCIFE_SR) Sequencer missed trigger event */
#define ADCIFE_SR_SMTRG             (_U_(0x1) << ADCIFE_SR_SMTRG_Pos)
#define ADCIFE_SR_SUTD_Pos          4            /**< \brief (ADCIFE_SR) Start-up time done */
#define ADCIFE_SR_SUTD              (_U_(0x1) << ADCIFE_SR_SUTD_Pos)
#define ADCIFE_SR_TTO_Pos           5            /**< \brief (ADCIFE_SR) Timer time-out */
#define ADCIFE_SR_TTO               (_U_(0x1) << ADCIFE_SR_TTO_Pos)
#define ADCIFE_SR_EN_Pos            24           /**< \brief (ADCIFE_SR) Enable Status */
#define ADCIFE_SR_EN                (_U_(0x1) << ADCIFE_SR_EN_Pos)
#define ADCIFE_SR_TBUSY_Pos         25           /**< \brief (ADCIFE_SR) Timer busy */
#define ADCIFE_SR_TBUSY             (_U_(0x1) << ADCIFE_SR_TBUSY_Pos)
#define ADCIFE_SR_SBUSY_Pos         26           /**< \brief (ADCIFE_SR) Sequencer busy */
#define ADCIFE_SR_SBUSY             (_U_(0x1) << ADCIFE_SR_SBUSY_Pos)
#define ADCIFE_SR_CBUSY_Pos         27           /**< \brief (ADCIFE_SR) Conversion busy */
#define ADCIFE_SR_CBUSY             (_U_(0x1) << ADCIFE_SR_CBUSY_Pos)
#define ADCIFE_SR_REFBUF_Pos        28           /**< \brief (ADCIFE_SR) Reference buffer status */
#define ADCIFE_SR_REFBUF            (_U_(0x1) << ADCIFE_SR_REFBUF_Pos)
#define ADCIFE_SR_MASK              _U_(0x1F00003F) /**< \brief (ADCIFE_SR) MASK Register */

/* -------- ADCIFE_SCR : (ADCIFE Offset: 0x0C) ( /W 32) Status Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SEOC:1;           /*!< bit:      0  Sequencer end of conversion        */
    uint32_t LOVR:1;           /*!< bit:      1  Sequencer last converted value overrun */
    uint32_t WM:1;             /*!< bit:      2  Window monitor                     */
    uint32_t SMTRG:1;          /*!< bit:      3  Sequencer missed trigger event     */
    uint32_t SUTD:1;           /*!< bit:      4  Start-up time done                 */
    uint32_t TTO:1;            /*!< bit:      5  Timer time-out                     */
    uint32_t :26;              /*!< bit:  6..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ADCIFE_SCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADCIFE_SCR_OFFSET           0x0C         /**< \brief (ADCIFE_SCR offset) Status Clear Register */
#define ADCIFE_SCR_RESETVALUE       _U_(0x00000000); /**< \brief (ADCIFE_SCR reset_value) Status Clear Register */

#define ADCIFE_SCR_SEOC_Pos         0            /**< \brief (ADCIFE_SCR) Sequencer end of conversion */
#define ADCIFE_SCR_SEOC             (_U_(0x1) << ADCIFE_SCR_SEOC_Pos)
#define ADCIFE_SCR_LOVR_Pos         1            /**< \brief (ADCIFE_SCR) Sequencer last converted value overrun */
#define ADCIFE_SCR_LOVR             (_U_(0x1) << ADCIFE_SCR_LOVR_Pos)
#define ADCIFE_SCR_WM_Pos           2            /**< \brief (ADCIFE_SCR) Window monitor */
#define ADCIFE_SCR_WM               (_U_(0x1) << ADCIFE_SCR_WM_Pos)
#define ADCIFE_SCR_SMTRG_Pos        3            /**< \brief (ADCIFE_SCR) Sequencer missed trigger event */
#define ADCIFE_SCR_SMTRG            (_U_(0x1) << ADCIFE_SCR_SMTRG_Pos)
#define ADCIFE_SCR_SUTD_Pos         4            /**< \brief (ADCIFE_SCR) Start-up time done */
#define ADCIFE_SCR_SUTD             (_U_(0x1) << ADCIFE_SCR_SUTD_Pos)
#define ADCIFE_SCR_TTO_Pos          5            /**< \brief (ADCIFE_SCR) Timer time-out */
#define ADCIFE_SCR_TTO              (_U_(0x1) << ADCIFE_SCR_TTO_Pos)
#define ADCIFE_SCR_MASK             _U_(0x0000003F) /**< \brief (ADCIFE_SCR) MASK Register */

/* -------- ADCIFE_RTS : (ADCIFE Offset: 0x10) (R/W 32) Resistive Touch Screen Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} ADCIFE_RTS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

