zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/adcife.h
#define ADCIFE_RTS_OFFSET           0x10         /**< \brief (ADCIFE_RTS offset) Resistive Touch Screen Register */
#define ADCIFE_RTS_RESETVALUE       _U_(0x00000000); /**< \brief (ADCIFE_RTS reset_value) Resistive Touch Screen Register */

#define ADCIFE_RTS_MASK             _U_(0x00000000) /**< \brief (ADCIFE_RTS) MASK Register */

/* -------- ADCIFE_SEQCFG : (ADCIFE Offset: 0x14) (R/W 32) Sequencer Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t HWLA:1;           /*!< bit:      0  Half word left adjust              */
    uint32_t :1;               /*!< bit:      1  Reserved                           */
    uint32_t BIPOLAR:1;        /*!< bit:      2  Bipolar Mode                       */
    uint32_t :1;               /*!< bit:      3  Reserved                           */
    uint32_t GAIN:3;           /*!< bit:  4.. 6  Gain factor                        */
    uint32_t GCOMP:1;          /*!< bit:      7  Gain Compensation                  */
    uint32_t TRGSEL:3;         /*!< bit:  8..10  Trigger selection                  */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t RES:1;            /*!< bit:     12  Resolution                         */
    uint32_t :1;               /*!< bit:     13  Reserved                           */
    uint32_t INTERNAL:2;       /*!< bit: 14..15  Internal Voltage Source Selection  */
    uint32_t MUXPOS:4;         /*!< bit: 16..19  MUX selection on Positive ADC input channel */
    uint32_t MUXNEG:3;         /*!< bit: 20..22  MUX selection on Negative ADC input channel */
    uint32_t :5;               /*!< bit: 23..27  Reserved                           */
    uint32_t ZOOMRANGE:3;      /*!< bit: 28..30  Zoom shift/unipolar reference source selection */
    uint32_t :1;               /*!< bit:     31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ADCIFE_SEQCFG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADCIFE_SEQCFG_OFFSET        0x14         /**< \brief (ADCIFE_SEQCFG offset) Sequencer Configuration Register */
#define ADCIFE_SEQCFG_RESETVALUE    _U_(0x00000000); /**< \brief (ADCIFE_SEQCFG reset_value) Sequencer Configuration Register */

#define ADCIFE_SEQCFG_HWLA_Pos      0            /**< \brief (ADCIFE_SEQCFG) Half word left adjust */
#define ADCIFE_SEQCFG_HWLA          (_U_(0x1) << ADCIFE_SEQCFG_HWLA_Pos)
#define ADCIFE_SEQCFG_BIPOLAR_Pos   2            /**< \brief (ADCIFE_SEQCFG) Bipolar Mode */
#define ADCIFE_SEQCFG_BIPOLAR       (_U_(0x1) << ADCIFE_SEQCFG_BIPOLAR_Pos)
#define ADCIFE_SEQCFG_GAIN_Pos      4            /**< \brief (ADCIFE_SEQCFG) Gain factor */
#define ADCIFE_SEQCFG_GAIN_Msk      (_U_(0x7) << ADCIFE_SEQCFG_GAIN_Pos)
#define ADCIFE_SEQCFG_GAIN(value)   (ADCIFE_SEQCFG_GAIN_Msk & ((value) << ADCIFE_SEQCFG_GAIN_Pos))
#define ADCIFE_SEQCFG_GCOMP_Pos     7            /**< \brief (ADCIFE_SEQCFG) Gain Compensation */
#define ADCIFE_SEQCFG_GCOMP         (_U_(0x1) << ADCIFE_SEQCFG_GCOMP_Pos)
#define ADCIFE_SEQCFG_TRGSEL_Pos    8            /**< \brief (ADCIFE_SEQCFG) Trigger selection */
#define ADCIFE_SEQCFG_TRGSEL_Msk    (_U_(0x7) << ADCIFE_SEQCFG_TRGSEL_Pos)
#define ADCIFE_SEQCFG_TRGSEL(value) (ADCIFE_SEQCFG_TRGSEL_Msk & ((value) << ADCIFE_SEQCFG_TRGSEL_Pos))
#define ADCIFE_SEQCFG_RES_Pos       12           /**< \brief (ADCIFE_SEQCFG) Resolution */
#define ADCIFE_SEQCFG_RES           (_U_(0x1) << ADCIFE_SEQCFG_RES_Pos)
#define ADCIFE_SEQCFG_INTERNAL_Pos  14           /**< \brief (ADCIFE_SEQCFG) Internal Voltage Source Selection */
#define ADCIFE_SEQCFG_INTERNAL_Msk  (_U_(0x3) << ADCIFE_SEQCFG_INTERNAL_Pos)
#define ADCIFE_SEQCFG_INTERNAL(value) (ADCIFE_SEQCFG_INTERNAL_Msk & ((value) << ADCIFE_SEQCFG_INTERNAL_Pos))
#define ADCIFE_SEQCFG_MUXPOS_Pos    16           /**< \brief (ADCIFE_SEQCFG) MUX selection on Positive ADC input channel */
#define ADCIFE_SEQCFG_MUXPOS_Msk    (_U_(0xF) << ADCIFE_SEQCFG_MUXPOS_Pos)
#define ADCIFE_SEQCFG_MUXPOS(value) (ADCIFE_SEQCFG_MUXPOS_Msk & ((value) << ADCIFE_SEQCFG_MUXPOS_Pos))
#define ADCIFE_SEQCFG_MUXNEG_Pos    20           /**< \brief (ADCIFE_SEQCFG) MUX selection on Negative ADC input channel */
#define ADCIFE_SEQCFG_MUXNEG_Msk    (_U_(0x7) << ADCIFE_SEQCFG_MUXNEG_Pos)
#define ADCIFE_SEQCFG_MUXNEG(value) (ADCIFE_SEQCFG_MUXNEG_Msk & ((value) << ADCIFE_SEQCFG_MUXNEG_Pos))
#define ADCIFE_SEQCFG_ZOOMRANGE_Pos 28           /**< \brief (ADCIFE_SEQCFG) Zoom shift/unipolar reference source selection */
#define ADCIFE_SEQCFG_ZOOMRANGE_Msk (_U_(0x7) << ADCIFE_SEQCFG_ZOOMRANGE_Pos)
#define ADCIFE_SEQCFG_ZOOMRANGE(value) (ADCIFE_SEQCFG_ZOOMRANGE_Msk & ((value) << ADCIFE_SEQCFG_ZOOMRANGE_Pos))
#define ADCIFE_SEQCFG_MASK          _U_(0x707FD7F5) /**< \brief (ADCIFE_SEQCFG) MASK Register */

/* -------- ADCIFE_CDMA : (ADCIFE Offset: 0x18) ( /W 32) Configuration Direct Memory Access Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct { // FIRST_DMA_WORD mode
    uint32_t HWLA:1;           /*!< bit:      0  Half word left adjust              */
    uint32_t :1;               /*!< bit:      1  Reserved                           */
    uint32_t BIPOLAR:1;        /*!< bit:      2  Bipolar Mode                       */
    uint32_t STRIG:1;          /*!< bit:      3  Sequencer Trigger Event            */
    uint32_t GAIN:3;           /*!< bit:  4.. 6  Gain factor                        */
    uint32_t GCOMP:1;          /*!< bit:      7  Gain Compensation                  */
    uint32_t ENSTUP:1;         /*!< bit:      8  Enable Start-Up Time               */
    uint32_t :3;               /*!< bit:  9..11  Reserved                           */
    uint32_t RES:1;            /*!< bit:     12  Resolution                         */
    uint32_t TSS:1;            /*!< bit:     13  Internal timer start or stop bit   */
    uint32_t INTERNAL:2;       /*!< bit: 14..15  Internal Voltage Source Selection  */
    uint32_t MUXPOS:4;         /*!< bit: 16..19  MUX selection on Positive ADC input channel */
    uint32_t MUXNEG:3;         /*!< bit: 20..22  MUX selection on Negative ADC input channel */
    uint32_t :5;               /*!< bit: 23..27  Reserved                           */
    uint32_t ZOOMRANGE:3;      /*!< bit: 28..30  Zoom shift/unipolar reference source selection */
    uint32_t DW:1;             /*!< bit:     31  Double Word transmitting           */
  } FIRST_DMA_WORD;            /*!< Structure used for FIRST_DMA_WORD               */
  struct { // SECOND_DMA_WORD mode
    uint32_t LT:12;            /*!< bit:  0..11  Low Threshold                      */
    uint32_t WM:3;             /*!< bit: 12..14  Window Monitor Mode                */
    uint32_t :1;               /*!< bit:     15  Reserved                           */
    uint32_t HT:12;            /*!< bit: 16..27  High Threshold                     */
    uint32_t :3;               /*!< bit: 28..30  Reserved                           */
    uint32_t DW:1;             /*!< bit:     31  Double Word transmitting           */
  } SECOND_DMA_WORD;           /*!< Structure used for SECOND_DMA_WORD              */
  uint32_t reg;                /*!< Type      used for register access              */
} ADCIFE_CDMA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADCIFE_CDMA_OFFSET          0x18         /**< \brief (ADCIFE_CDMA offset) Configuration Direct Memory Access Register */
#define ADCIFE_CDMA_RESETVALUE      _U_(0x00000000); /**< \brief (ADCIFE_CDMA reset_value) Configuration Direct Memory Access Register */

// FIRST_DMA_WORD mode
#define ADCIFE_CDMA_FIRST_DMA_WORD_HWLA_Pos 0            /**< \brief (ADCIFE_CDMA_FIRST_DMA_WORD) Half word left adjust */
#define ADCIFE_CDMA_FIRST_DMA_WORD_HWLA (_U_(0x1) << ADCIFE_CDMA_FIRST_DMA_WORD_HWLA_Pos)
#define ADCIFE_CDMA_FIRST_DMA_WORD_BIPOLAR_Pos 2            /**< \brief (ADCIFE_CDMA_FIRST_DMA_WORD) Bipolar Mode */
#define ADCIFE_CDMA_FIRST_DMA_WORD_BIPOLAR (_U_(0x1) << ADCIFE_CDMA_FIRST_DMA_WORD_BIPOLAR_Pos)
#define ADCIFE_CDMA_FIRST_DMA_WORD_STRIG_Pos 3            /**< \brief (ADCIFE_CDMA_FIRST_DMA_WORD) Sequencer Trigger Event */
#define ADCIFE_CDMA_FIRST_DMA_WORD_STRIG (_U_(0x1) << ADCIFE_CDMA_FIRST_DMA_WORD_STRIG_Pos)
#define ADCIFE_CDMA_FIRST_DMA_WORD_GAIN_Pos 4            /**< \brief (ADCIFE_CDMA_FIRST_DMA_WORD) Gain factor */
#define ADCIFE_CDMA_FIRST_DMA_WORD_GAIN_Msk (_U_(0x7) << ADCIFE_CDMA_FIRST_DMA_WORD_GAIN_Pos)
#define ADCIFE_CDMA_FIRST_DMA_WORD_GAIN(value) (ADCIFE_CDMA_FIRST_DMA_WORD_GAIN_Msk & ((value) << ADCIFE_CDMA_FIRST_DMA_WORD_GAIN_Pos))
#define ADCIFE_CDMA_FIRST_DMA_WORD_GCOMP_Pos 7            /**< \brief (ADCIFE_CDMA_FIRST_DMA_WORD) Gain Compensation */
#define ADCIFE_CDMA_FIRST_DMA_WORD_GCOMP (_U_(0x1) << ADCIFE_CDMA_FIRST_DMA_WORD_GCOMP_Pos)
#define ADCIFE_CDMA_FIRST_DMA_WORD_ENSTUP_Pos 8            /**< \brief (ADCIFE_CDMA_FIRST_DMA_WORD) Enable Start-Up Time */
#define ADCIFE_CDMA_FIRST_DMA_WORD_ENSTUP (_U_(0x1) << ADCIFE_CDMA_FIRST_DMA_WORD_ENSTUP_Pos)
#define ADCIFE_CDMA_FIRST_DMA_WORD_RES_Pos 12           /**< \brief (ADCIFE_CDMA_FIRST_DMA_WORD) Resolution */
#define ADCIFE_CDMA_FIRST_DMA_WORD_RES (_U_(0x1) << ADCIFE_CDMA_FIRST_DMA_WORD_RES_Pos)
#define ADCIFE_CDMA_FIRST_DMA_WORD_TSS_Pos 13           /**< \brief (ADCIFE_CDMA_FIRST_DMA_WORD) Internal timer start or stop bit */
#define ADCIFE_CDMA_FIRST_DMA_WORD_TSS (_U_(0x1) << ADCIFE_CDMA_FIRST_DMA_WORD_TSS_Pos)
#define ADCIFE_CDMA_FIRST_DMA_WORD_INTERNAL_Pos 14           /**< \brief (ADCIFE_CDMA_FIRST_DMA_WORD) Internal Voltage Source Selection */
#define ADCIFE_CDMA_FIRST_DMA_WORD_INTERNAL_Msk (_U_(0x3) << ADCIFE_CDMA_FIRST_DMA_WORD_INTERNAL_Pos)
#define ADCIFE_CDMA_FIRST_DMA_WORD_INTERNAL(value) (ADCIFE_CDMA_FIRST_DMA_WORD_INTERNAL_Msk & ((value) << ADCIFE_CDMA_FIRST_DMA_WORD_INTERNAL_Pos))
#define ADCIFE_CDMA_FIRST_DMA_WORD_MUXPOS_Pos 16           /**< \brief (ADCIFE_CDMA_FIRST_DMA_WORD) MUX selection on Positive ADC input channel */
#define ADCIFE_CDMA_FIRST_DMA_WORD_MUXPOS_Msk (_U_(0xF) << ADCIFE_CDMA_FIRST_DMA_WORD_MUXPOS_Pos)
#define ADCIFE_CDMA_FIRST_DMA_WORD_MUXPOS(value) (ADCIFE_CDMA_FIRST_DMA_WORD_MUXPOS_Msk & ((value) << ADCIFE_CDMA_FIRST_DMA_WORD_MUXPOS_Pos))
#define ADCIFE_CDMA_FIRST_DMA_WORD_MUXNEG_Pos 20           /**< \brief (ADCIFE_CDMA_FIRST_DMA_WORD) MUX selection on Negative ADC input channel */
#define ADCIFE_CDMA_FIRST_DMA_WORD_MUXNEG_Msk (_U_(0x7) << ADCIFE_CDMA_FIRST_DMA_WORD_MUXNEG_Pos)
#define ADCIFE_CDMA_FIRST_DMA_WORD_MUXNEG(value) (ADCIFE_CDMA_FIRST_DMA_WORD_MUXNEG_Msk & ((value) << ADCIFE_CDMA_FIRST_DMA_WORD_MUXNEG_Pos))
#define ADCIFE_CDMA_FIRST_DMA_WORD_ZOOMRANGE_Pos 28           /**< \brief (ADCIFE_CDMA_FIRST_DMA_WORD) Zoom shift/unipolar reference source selection */
#define ADCIFE_CDMA_FIRST_DMA_WORD_ZOOMRANGE_Msk (_U_(0x7) << ADCIFE_CDMA_FIRST_DMA_WORD_ZOOMRANGE_Pos)
#define ADCIFE_CDMA_FIRST_DMA_WORD_ZOOMRANGE(value) (ADCIFE_CDMA_FIRST_DMA_WORD_ZOOMRANGE_Msk & ((value) << ADCIFE_CDMA_FIRST_DMA_WORD_ZOOMRANGE_Pos))
#define ADCIFE_CDMA_FIRST_DMA_WORD_DW_Pos 31           /**< \brief (ADCIFE_CDMA_FIRST_DMA_WORD) Double Word transmitting */
#define ADCIFE_CDMA_FIRST_DMA_WORD_DW (_U_(0x1) << ADCIFE_CDMA_FIRST_DMA_WORD_DW_Pos)
#define ADCIFE_CDMA_FIRST_DMA_WORD_MASK _U_(0xF07FF1FD) /**< \brief (ADCIFE_CDMA_FIRST_DMA_WORD) MASK Register */

// SECOND_DMA_WORD mode
#define ADCIFE_CDMA_SECOND_DMA_WORD_LT_Pos 0            /**< \brief (ADCIFE_CDMA_SECOND_DMA_WORD) Low Threshold */
#define ADCIFE_CDMA_SECOND_DMA_WORD_LT_Msk (_U_(0xFFF) << ADCIFE_CDMA_SECOND_DMA_WORD_LT_Pos)
#define ADCIFE_CDMA_SECOND_DMA_WORD_LT(value) (ADCIFE_CDMA_SECOND_DMA_WORD_LT_Msk & ((value) << ADCIFE_CDMA_SECOND_DMA_WORD_LT_Pos))
#define ADCIFE_CDMA_SECOND_DMA_WORD_WM_Pos 12           /**< \brief (ADCIFE_CDMA_SECOND_DMA_WORD) Window Monitor Mode */
#define ADCIFE_CDMA_SECOND_DMA_WORD_WM_Msk (_U_(0x7) << ADCIFE_CDMA_SECOND_DMA_WORD_WM_Pos)
#define ADCIFE_CDMA_SECOND_DMA_WORD_WM(value) (ADCIFE_CDMA_SECOND_DMA_WORD_WM_Msk & ((value) << ADCIFE_CDMA_SECOND_DMA_WORD_WM_Pos))
#define ADCIFE_CDMA_SECOND_DMA_WORD_HT_Pos 16           /**< \brief (ADCIFE_CDMA_SECOND_DMA_WORD) High Threshold */
#define ADCIFE_CDMA_SECOND_DMA_WORD_HT_Msk (_U_(0xFFF) << ADCIFE_CDMA_SECOND_DMA_WORD_HT_Pos)
#define ADCIFE_CDMA_SECOND_DMA_WORD_HT(value) (ADCIFE_CDMA_SECOND_DMA_WORD_HT_Msk & ((value) << ADCIFE_CDMA_SECOND_DMA_WORD_HT_Pos))
#define ADCIFE_CDMA_SECOND_DMA_WORD_DW_Pos 31           /**< \brief (ADCIFE_CDMA_SECOND_DMA_WORD) Double Word transmitting */
#define ADCIFE_CDMA_SECOND_DMA_WORD_DW (_U_(0x1) << ADCIFE_CDMA_SECOND_DMA_WORD_DW_Pos)
#define ADCIFE_CDMA_SECOND_DMA_WORD_MASK _U_(0x8FFF7FFF) /**< \brief (ADCIFE_CDMA_SECOND_DMA_WORD) MASK Register */

// Any mode
#define ADCIFE_CDMA_HWLA_Pos        0            /**< \brief (ADCIFE_CDMA) Half word left adjust */
#define ADCIFE_CDMA_HWLA            (_U_(0x1) << ADCIFE_CDMA_HWLA_Pos)
#define ADCIFE_CDMA_LT_Pos          0            /**< \brief (ADCIFE_CDMA) Low Threshold */
#define ADCIFE_CDMA_LT_Msk          (_U_(0xFFF) << ADCIFE_CDMA_LT_Pos)
#define ADCIFE_CDMA_LT(value)       (ADCIFE_CDMA_LT_Msk & ((value) << ADCIFE_CDMA_LT_Pos))
#define ADCIFE_CDMA_BIPOLAR_Pos     2            /**< \brief (ADCIFE_CDMA) Bipolar Mode */
#define ADCIFE_CDMA_BIPOLAR         (_U_(0x1) << ADCIFE_CDMA_BIPOLAR_Pos)
#define ADCIFE_CDMA_STRIG_Pos       3            /**< \brief (ADCIFE_CDMA) Sequencer Trigger Event */
#define ADCIFE_CDMA_STRIG           (_U_(0x1) << ADCIFE_CDMA_STRIG_Pos)
#define ADCIFE_CDMA_GAIN_Pos        4            /**< \brief (ADCIFE_CDMA) Gain factor */
#define ADCIFE_CDMA_GAIN_Msk        (_U_(0x7) << ADCIFE_CDMA_GAIN_Pos)
#define ADCIFE_CDMA_GAIN(value)     (ADCIFE_CDMA_GAIN_Msk & ((value) << ADCIFE_CDMA_GAIN_Pos))
#define ADCIFE_CDMA_GCOMP_Pos       7            /**< \brief (ADCIFE_CDMA) Gain Compensation */
#define ADCIFE_CDMA_GCOMP           (_U_(0x1) << ADCIFE_CDMA_GCOMP_Pos)
#define ADCIFE_CDMA_ENSTUP_Pos      8            /**< \brief (ADCIFE_CDMA) Enable Start-Up Time */
#define ADCIFE_CDMA_ENSTUP          (_U_(0x1) << ADCIFE_CDMA_ENSTUP_Pos)
#define ADCIFE_CDMA_RES_Pos         12           /**< \brief (ADCIFE_CDMA) Resolution */
#define ADCIFE_CDMA_RES             (_U_(0x1) << ADCIFE_CDMA_RES_Pos)
#define ADCIFE_CDMA_WM_Pos          12           /**< \brief (ADCIFE_CDMA) Window Monitor Mode */
#define ADCIFE_CDMA_WM_Msk          (_U_(0x7) << ADCIFE_CDMA_WM_Pos)
#define ADCIFE_CDMA_WM(value)       (ADCIFE_CDMA_WM_Msk & ((value) << ADCIFE_CDMA_WM_Pos))
#define ADCIFE_CDMA_TSS_Pos         13           /**< \brief (ADCIFE_CDMA) Internal timer start or stop bit */
#define ADCIFE_CDMA_TSS             (_U_(0x1) << ADCIFE_CDMA_TSS_Pos)
#define ADCIFE_CDMA_INTERNAL_Pos    14           /**< \brief (ADCIFE_CDMA) Internal Voltage Source Selection */
#define ADCIFE_CDMA_INTERNAL_Msk    (_U_(0x3) << ADCIFE_CDMA_INTERNAL_Pos)
#define ADCIFE_CDMA_INTERNAL(value) (ADCIFE_CDMA_INTERNAL_Msk & ((value) << ADCIFE_CDMA_INTERNAL_Pos))
#define ADCIFE_CDMA_MUXPOS_Pos      16           /**< \brief (ADCIFE_CDMA) MUX selection on Positive ADC input channel */
#define ADCIFE_CDMA_MUXPOS_Msk      (_U_(0xF) << ADCIFE_CDMA_MUXPOS_Pos)
#define ADCIFE_CDMA_MUXPOS(value)   (ADCIFE_CDMA_MUXPOS_Msk & ((value) << ADCIFE_CDMA_MUXPOS_Pos))
#define ADCIFE_CDMA_HT_Pos          16           /**< \brief (ADCIFE_CDMA) High Threshold */
#define ADCIFE_CDMA_HT_Msk          (_U_(0xFFF) << ADCIFE_CDMA_HT_Pos)
#define ADCIFE_CDMA_HT(value)       (ADCIFE_CDMA_HT_Msk & ((value) << ADCIFE_CDMA_HT_Pos))
#define ADCIFE_CDMA_MUXNEG_Pos      20           /**< \brief (ADCIFE_CDMA) MUX selection on Negative ADC input channel */
#define ADCIFE_CDMA_MUXNEG_Msk      (_U_(0x7) << ADCIFE_CDMA_MUXNEG_Pos)
#define ADCIFE_CDMA_MUXNEG(value)   (ADCIFE_CDMA_MUXNEG_Msk & ((value) << ADCIFE_CDMA_MUXNEG_Pos))
#define ADCIFE_CDMA_ZOOMRANGE_Pos   28           /**< \brief (ADCIFE_CDMA) Zoom shift/unipolar reference source selection */
#define ADCIFE_CDMA_ZOOMRANGE_Msk   (_U_(0x7) << ADCIFE_CDMA_ZOOMRANGE_Pos)
#define ADCIFE_CDMA_ZOOMRANGE(value) (ADCIFE_CDMA_ZOOMRANGE_Msk & ((value) << ADCIFE_CDMA_ZOOMRANGE_Pos))
#define ADCIFE_CDMA_DW_Pos          31           /**< \brief (ADCIFE_CDMA) Double Word transmitting */
#define ADCIFE_CDMA_DW              (_U_(0x1) << ADCIFE_CDMA_DW_Pos)
#define ADCIFE_CDMA_MASK            _U_(0xFFFFFFFF) /**< \brief (ADCIFE_CDMA) MASK Register */

/* -------- ADCIFE_TIM : (ADCIFE Offset: 0x1C) (R/W 32) Timing Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t STARTUP:5;        /*!< bit:  0.. 4  Startup time                       */
    uint32_t :3;               /*!< bit:  5.. 7  Reserved                           */
    uint32_t ENSTUP:1;         /*!< bit:      8  Enable Startup                     */
    uint32_t :23;              /*!< bit:  9..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ADCIFE_TIM_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

