zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/adcife.h
#define ADCIFE_TIM_OFFSET           0x1C         /**< \brief (ADCIFE_TIM offset) Timing Configuration Register */
#define ADCIFE_TIM_RESETVALUE       _U_(0x00000000); /**< \brief (ADCIFE_TIM reset_value) Timing Configuration Register */

#define ADCIFE_TIM_STARTUP_Pos      0            /**< \brief (ADCIFE_TIM) Startup time */
#define ADCIFE_TIM_STARTUP_Msk      (_U_(0x1F) << ADCIFE_TIM_STARTUP_Pos)
#define ADCIFE_TIM_STARTUP(value)   (ADCIFE_TIM_STARTUP_Msk & ((value) << ADCIFE_TIM_STARTUP_Pos))
#define ADCIFE_TIM_ENSTUP_Pos       8            /**< \brief (ADCIFE_TIM) Enable Startup */
#define ADCIFE_TIM_ENSTUP           (_U_(0x1) << ADCIFE_TIM_ENSTUP_Pos)
#define ADCIFE_TIM_MASK             _U_(0x0000011F) /**< \brief (ADCIFE_TIM) MASK Register */

/* -------- ADCIFE_ITIMER : (ADCIFE Offset: 0x20) (R/W 32) Internal Timer Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ITMC:16;          /*!< bit:  0..15  Internal timer max counter         */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ADCIFE_ITIMER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADCIFE_ITIMER_OFFSET        0x20         /**< \brief (ADCIFE_ITIMER offset) Internal Timer Register */
#define ADCIFE_ITIMER_RESETVALUE    _U_(0x00000000); /**< \brief (ADCIFE_ITIMER reset_value) Internal Timer Register */

#define ADCIFE_ITIMER_ITMC_Pos      0            /**< \brief (ADCIFE_ITIMER) Internal timer max counter */
#define ADCIFE_ITIMER_ITMC_Msk      (_U_(0xFFFF) << ADCIFE_ITIMER_ITMC_Pos)
#define ADCIFE_ITIMER_ITMC(value)   (ADCIFE_ITIMER_ITMC_Msk & ((value) << ADCIFE_ITIMER_ITMC_Pos))
#define ADCIFE_ITIMER_MASK          _U_(0x0000FFFF) /**< \brief (ADCIFE_ITIMER) MASK Register */

/* -------- ADCIFE_WCFG : (ADCIFE Offset: 0x24) (R/W 32) Window Monitor Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :12;              /*!< bit:  0..11  Reserved                           */
    uint32_t WM:3;             /*!< bit: 12..14  Window Monitor Mode                */
    uint32_t :17;              /*!< bit: 15..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ADCIFE_WCFG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADCIFE_WCFG_OFFSET          0x24         /**< \brief (ADCIFE_WCFG offset) Window Monitor Configuration Register */
#define ADCIFE_WCFG_RESETVALUE      _U_(0x00000000); /**< \brief (ADCIFE_WCFG reset_value) Window Monitor Configuration Register */

#define ADCIFE_WCFG_WM_Pos          12           /**< \brief (ADCIFE_WCFG) Window Monitor Mode */
#define ADCIFE_WCFG_WM_Msk          (_U_(0x7) << ADCIFE_WCFG_WM_Pos)
#define ADCIFE_WCFG_WM(value)       (ADCIFE_WCFG_WM_Msk & ((value) << ADCIFE_WCFG_WM_Pos))
#define ADCIFE_WCFG_MASK            _U_(0x00007000) /**< \brief (ADCIFE_WCFG) MASK Register */

/* -------- ADCIFE_WTH : (ADCIFE Offset: 0x28) (R/W 32) Window Monitor Threshold Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t LT:12;            /*!< bit:  0..11  Low threshold                      */
    uint32_t :4;               /*!< bit: 12..15  Reserved                           */
    uint32_t HT:12;            /*!< bit: 16..27  High Threshold                     */
    uint32_t :4;               /*!< bit: 28..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ADCIFE_WTH_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADCIFE_WTH_OFFSET           0x28         /**< \brief (ADCIFE_WTH offset) Window Monitor Threshold Configuration Register */
#define ADCIFE_WTH_RESETVALUE       _U_(0x00000000); /**< \brief (ADCIFE_WTH reset_value) Window Monitor Threshold Configuration Register */

#define ADCIFE_WTH_LT_Pos           0            /**< \brief (ADCIFE_WTH) Low threshold */
#define ADCIFE_WTH_LT_Msk           (_U_(0xFFF) << ADCIFE_WTH_LT_Pos)
#define ADCIFE_WTH_LT(value)        (ADCIFE_WTH_LT_Msk & ((value) << ADCIFE_WTH_LT_Pos))
#define ADCIFE_WTH_HT_Pos           16           /**< \brief (ADCIFE_WTH) High Threshold */
#define ADCIFE_WTH_HT_Msk           (_U_(0xFFF) << ADCIFE_WTH_HT_Pos)
#define ADCIFE_WTH_HT(value)        (ADCIFE_WTH_HT_Msk & ((value) << ADCIFE_WTH_HT_Pos))
#define ADCIFE_WTH_MASK             _U_(0x0FFF0FFF) /**< \brief (ADCIFE_WTH) MASK Register */

/* -------- ADCIFE_LCV : (ADCIFE Offset: 0x2C) (R/  32) Sequencer Last Converted Value Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t LCV:16;           /*!< bit:  0..15  Last converted value               */
    uint32_t LCPC:4;           /*!< bit: 16..19  Last converted positive channel    */
    uint32_t LCNC:3;           /*!< bit: 20..22  Last converted negative channel    */
    uint32_t :9;               /*!< bit: 23..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ADCIFE_LCV_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADCIFE_LCV_OFFSET           0x2C         /**< \brief (ADCIFE_LCV offset) Sequencer Last Converted Value Register */
#define ADCIFE_LCV_RESETVALUE       _U_(0x00000000); /**< \brief (ADCIFE_LCV reset_value) Sequencer Last Converted Value Register */

#define ADCIFE_LCV_LCV_Pos          0            /**< \brief (ADCIFE_LCV) Last converted value */
#define ADCIFE_LCV_LCV_Msk          (_U_(0xFFFF) << ADCIFE_LCV_LCV_Pos)
#define ADCIFE_LCV_LCV(value)       (ADCIFE_LCV_LCV_Msk & ((value) << ADCIFE_LCV_LCV_Pos))
#define ADCIFE_LCV_LCPC_Pos         16           /**< \brief (ADCIFE_LCV) Last converted positive channel */
#define ADCIFE_LCV_LCPC_Msk         (_U_(0xF) << ADCIFE_LCV_LCPC_Pos)
#define ADCIFE_LCV_LCPC(value)      (ADCIFE_LCV_LCPC_Msk & ((value) << ADCIFE_LCV_LCPC_Pos))
#define ADCIFE_LCV_LCNC_Pos         20           /**< \brief (ADCIFE_LCV) Last converted negative channel */
#define ADCIFE_LCV_LCNC_Msk         (_U_(0x7) << ADCIFE_LCV_LCNC_Pos)
#define ADCIFE_LCV_LCNC(value)      (ADCIFE_LCV_LCNC_Msk & ((value) << ADCIFE_LCV_LCNC_Pos))
#define ADCIFE_LCV_MASK             _U_(0x007FFFFF) /**< \brief (ADCIFE_LCV) MASK Register */

