zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/adcife.h
/* -------- ADCIFE_IER : (ADCIFE Offset: 0x30) ( /W 32) Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SEOC:1;           /*!< bit:      0  Sequencer end of conversion Interrupt Enable */
    uint32_t LOVR:1;           /*!< bit:      1  Sequencer last converted value overrun Interrupt Enable */
    uint32_t WM:1;             /*!< bit:      2  Window monitor Interrupt Enable    */
    uint32_t SMTRG:1;          /*!< bit:      3  Sequencer missed trigger event Interrupt Enable */
    uint32_t :1;               /*!< bit:      4  Reserved                           */
    uint32_t TTO:1;            /*!< bit:      5  Timer time-out Interrupt Enable    */
    uint32_t :26;              /*!< bit:  6..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ADCIFE_IER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADCIFE_IER_OFFSET           0x30         /**< \brief (ADCIFE_IER offset) Interrupt Enable Register */
#define ADCIFE_IER_RESETVALUE       _U_(0x00000000); /**< \brief (ADCIFE_IER reset_value) Interrupt Enable Register */

#define ADCIFE_IER_SEOC_Pos         0            /**< \brief (ADCIFE_IER) Sequencer end of conversion Interrupt Enable */
#define ADCIFE_IER_SEOC             (_U_(0x1) << ADCIFE_IER_SEOC_Pos)
#define ADCIFE_IER_LOVR_Pos         1            /**< \brief (ADCIFE_IER) Sequencer last converted value overrun Interrupt Enable */
#define ADCIFE_IER_LOVR             (_U_(0x1) << ADCIFE_IER_LOVR_Pos)
#define ADCIFE_IER_WM_Pos           2            /**< \brief (ADCIFE_IER) Window monitor Interrupt Enable */
#define ADCIFE_IER_WM               (_U_(0x1) << ADCIFE_IER_WM_Pos)
#define ADCIFE_IER_SMTRG_Pos        3            /**< \brief (ADCIFE_IER) Sequencer missed trigger event Interrupt Enable */
#define ADCIFE_IER_SMTRG            (_U_(0x1) << ADCIFE_IER_SMTRG_Pos)
#define ADCIFE_IER_TTO_Pos          5            /**< \brief (ADCIFE_IER) Timer time-out Interrupt Enable */
#define ADCIFE_IER_TTO              (_U_(0x1) << ADCIFE_IER_TTO_Pos)
#define ADCIFE_IER_MASK             _U_(0x0000002F) /**< \brief (ADCIFE_IER) MASK Register */

/* -------- ADCIFE_IDR : (ADCIFE Offset: 0x34) ( /W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SEOC:1;           /*!< bit:      0  Sequencer end of conversion Interrupt Disable */
    uint32_t LOVR:1;           /*!< bit:      1  Sequencer last converted value overrun Interrupt Disable */
    uint32_t WM:1;             /*!< bit:      2  Window monitor Interrupt Disable   */
    uint32_t SMTRG:1;          /*!< bit:      3  Sequencer missed trigger event Interrupt Disable */
    uint32_t :1;               /*!< bit:      4  Reserved                           */
    uint32_t TTO:1;            /*!< bit:      5  Timer time-out Interrupt Disable   */
    uint32_t :26;              /*!< bit:  6..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ADCIFE_IDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADCIFE_IDR_OFFSET           0x34         /**< \brief (ADCIFE_IDR offset) Interrupt Disable Register */
#define ADCIFE_IDR_RESETVALUE       _U_(0x00000000); /**< \brief (ADCIFE_IDR reset_value) Interrupt Disable Register */

#define ADCIFE_IDR_SEOC_Pos         0            /**< \brief (ADCIFE_IDR) Sequencer end of conversion Interrupt Disable */
#define ADCIFE_IDR_SEOC             (_U_(0x1) << ADCIFE_IDR_SEOC_Pos)
#define ADCIFE_IDR_LOVR_Pos         1            /**< \brief (ADCIFE_IDR) Sequencer last converted value overrun Interrupt Disable */
#define ADCIFE_IDR_LOVR             (_U_(0x1) << ADCIFE_IDR_LOVR_Pos)
#define ADCIFE_IDR_WM_Pos           2            /**< \brief (ADCIFE_IDR) Window monitor Interrupt Disable */
#define ADCIFE_IDR_WM               (_U_(0x1) << ADCIFE_IDR_WM_Pos)
#define ADCIFE_IDR_SMTRG_Pos        3            /**< \brief (ADCIFE_IDR) Sequencer missed trigger event Interrupt Disable */
#define ADCIFE_IDR_SMTRG            (_U_(0x1) << ADCIFE_IDR_SMTRG_Pos)
#define ADCIFE_IDR_TTO_Pos          5            /**< \brief (ADCIFE_IDR) Timer time-out Interrupt Disable */
#define ADCIFE_IDR_TTO              (_U_(0x1) << ADCIFE_IDR_TTO_Pos)
#define ADCIFE_IDR_MASK             _U_(0x0000002F) /**< \brief (ADCIFE_IDR) MASK Register */

/* -------- ADCIFE_IMR : (ADCIFE Offset: 0x38) (R/  32) Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SEOC:1;           /*!< bit:      0  Sequencer end of conversion Interrupt Mask */
    uint32_t LOVR:1;           /*!< bit:      1  Sequencer last converted value overrun Interrupt Mask */
    uint32_t WM:1;             /*!< bit:      2  Window monitor Interrupt Mask      */
    uint32_t SMTRG:1;          /*!< bit:      3  Sequencer missed trigger event Interrupt Mask */
    uint32_t :1;               /*!< bit:      4  Reserved                           */
    uint32_t TTO:1;            /*!< bit:      5  Timer time-out Interrupt Mask      */
    uint32_t :26;              /*!< bit:  6..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ADCIFE_IMR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADCIFE_IMR_OFFSET           0x38         /**< \brief (ADCIFE_IMR offset) Interrupt Mask Register */
#define ADCIFE_IMR_RESETVALUE       _U_(0x00000000); /**< \brief (ADCIFE_IMR reset_value) Interrupt Mask Register */

#define ADCIFE_IMR_SEOC_Pos         0            /**< \brief (ADCIFE_IMR) Sequencer end of conversion Interrupt Mask */
#define ADCIFE_IMR_SEOC             (_U_(0x1) << ADCIFE_IMR_SEOC_Pos)
#define ADCIFE_IMR_LOVR_Pos         1            /**< \brief (ADCIFE_IMR) Sequencer last converted value overrun Interrupt Mask */
#define ADCIFE_IMR_LOVR             (_U_(0x1) << ADCIFE_IMR_LOVR_Pos)
#define ADCIFE_IMR_WM_Pos           2            /**< \brief (ADCIFE_IMR) Window monitor Interrupt Mask */
#define ADCIFE_IMR_WM               (_U_(0x1) << ADCIFE_IMR_WM_Pos)
#define ADCIFE_IMR_SMTRG_Pos        3            /**< \brief (ADCIFE_IMR) Sequencer missed trigger event Interrupt Mask */
#define ADCIFE_IMR_SMTRG            (_U_(0x1) << ADCIFE_IMR_SMTRG_Pos)
#define ADCIFE_IMR_TTO_Pos          5            /**< \brief (ADCIFE_IMR) Timer time-out Interrupt Mask */
#define ADCIFE_IMR_TTO              (_U_(0x1) << ADCIFE_IMR_TTO_Pos)
#define ADCIFE_IMR_MASK             _U_(0x0000002F) /**< \brief (ADCIFE_IMR) MASK Register */

